Config = {}

Config['Weapon'] = {
    ["WEAPON_UNARMED"] = {
        Damage = 4 , 
        ----------------------------------------------------
        Critical = true, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_DAGGER"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_BAT"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = true, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_BOTTLE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_CROWBAR"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_FLASHLIGHT"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_GOLFCLUB"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = true, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_HAMMER"] = {
        Damage = 10 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_HATCHET"] = {
        Damage = 5 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_KNUCKLE"] = {
        Damage = 11 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_KNIFE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_MACHETE"] = {
        Damage = 34 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_SWITCHBLADE"] = {
        Damage = 29 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_POOLCUE"] = {
        Damage = 18 , 
        ----------------------------------------------------
        Critical = true, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
    ["WEAPON_RUN_OVER_BY_CAR"] = {
        Damage = 0 , 
        ----------------------------------------------------
        Critical = false, -- ใช้ได้เฉพาะไม้เท่านั้น
        Percent = 100
        ----------------------------------------------------
    },
}